Ran Plan for project: `team-ops-dev` dir: `terraform/teams/team-ops/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.external-data-landing-zone.google_project.project will be created
+ resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "019E58-6F6589-65814F"
      + deletion_policy     = "DELETE"
      + effective_labels    = (known after apply)
      + folder_id           = "123456789012"
      + id                  = (known after apply)
      + name                = "ext-data-land"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.external-data-landing-zone.google_project_service.apis["compute.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "compute.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["container.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "container.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["iam.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["storage.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage.googleapis.com"
    }

  # module.external-data-landing-zone.random_string.suffix will be created
+ resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p team-ops-dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://eaafcb0a388e:4141/lock?id=mailamiton%252Fgcp-infra-using-terraform%252Fterraform%252Fteams%252Fteam-ops%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p team-ops-dev
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```